src/views/guia-emacs/emacs-magit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-04 dom 17:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guía Emacs - Versionando Proyectos con MAGIT</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jelou" />
<link rel="stylesheet" type="text/css" href="/assets/css/style.css"/>
<link rel="stylesheet" type="text/css" href="/assets/css/sass-style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Guía Emacs - Versionando Proyectos con MAGIT</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org516d86b">1. Traer cambios de un branch al master</a></li>
<li><a href="#orgbed1af9">2. Diferencia entre master y origin/master</a>
<ul>
<li><a href="#orge43044c">2.1. Procedimiento</a></li>
<li><a href="#org2c65cd0">2.2. Referencias Web Extraoficiales</a></li>
</ul>
</li>
<li><a href="#orga41ea6f">3. Guardar cambios de forma temporal (Stash)</a>
<ul>
<li><a href="#org2065c8f">3.1. Procedimiento</a></li>
<li><a href="#org42a3f62">3.2. Referencias Web Extraoficiales</a></li>
</ul>
</li>
<li><a href="#orgb377333">4. Listar historial de commits de un archivo</a>
<ul>
<li><a href="#org26bc9b9">4.1. Procedimiento</a></li>
<li><a href="#org506b41a">4.2. Referencias Web Oficiales</a></li>
</ul>
</li>
<li><a href="#org90127e1">5. Atajos</a></li>
<li><a href="#org5cec80e">6. Posibles Situaciones</a>
<ul>
<li><a href="#orgfc3879b">6.1. Hacer cambios, subirlos y actualizar</a></li>
<li><a href="#org9b6f5ba">6.2. Resolver conflicto, diferencia entre archivos</a></li>
</ul>
</li>
<li><a href="#org0ea77df">7. Referencias</a>
<ul>
<li><a href="#org18e8544">7.1. Paginas recomendadas</a></li>
<li><a href="#org247f5ff">7.2. Videos de recomendados</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org516d86b" class="outline-2">
<h2 id="org516d86b"><span class="section-number-2">1</span> Traer cambios de un branch al master</h2>
<div class="outline-text-2" id="text-1">
<p>
Si hicimos cambios y los guardamos en <b>*branches</b> y queremos traerlos al <b>branch master</b> (suele ser la ultima version, la que ira a produccion)
</p>

<ol class="org-ol">
<li>Cambiamos al <b>branch master</b>
Presionamos <code>SPC g s</code> para acceder al menu de Magit, 
luego <code>b b</code> y elegimos el <b>master branch</b> (no es lo mismo que origin/master)</li>
<li>Hacemos <b>(merge)</b> con el branch que queremos (Ej. hotfix branch o testing branch)
Presionamos <code>SPC g s</code> luego <code>m m</code> y elegimos el <b>branch</b> para traer los cambios al <b>master branch</b></li>
<li>Hacemos <b>(push)</b> del <b>(merge)</b>
Presionamos con <code>SPC g s</code> luego <code>p p</code></li>
</ol>
</div>
</div>
<div id="outline-container-orgbed1af9" class="outline-2">
<h2 id="orgbed1af9"><span class="section-number-2">2</span> Diferencia entre master y origin/master</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge43044c" class="outline-3">
<h3 id="orge43044c"><span class="section-number-3">2.1</span> Procedimiento</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Del ejemplo anterior quizas puede aparecer esto, y pueden surgir dudas.
</p>

<p>
Cuando se dice <b>master</b> se refiere al <b>local branch</b> (el entorno local),
mientras que <b>origin/master</b> hace referencia al <b>remote branch</b> (el que esta en el servidor github)
</p>

<p>
<b>Observación:</b>
Lo mismo aplica con los <b>branches</b>
</p>

<p>
Por ejemplo origin/hotfix y hotfix, origin/testing y testing, etc..
</p>
</div>
</div>
<div id="outline-container-org2c65cd0" class="outline-3">
<h3 id="org2c65cd0"><span class="section-number-3">2.2</span> Referencias Web Extraoficiales</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Referencia #1 - Stackify.com - [Ver Pagina](<a href="https://stackify.com/git-checkout-remote-branch/">https://stackify.com/git-checkout-remote-branch/</a>)</li>
<li>Referencia #2 - Stackoverfow - [Ver Pagina](<a href="https://stackoverflow.com/questions/48596045/git-difference-between-origin-master-and-origin-master">https://stackoverflow.com/questions/48596045/git-difference-between-origin-master-and-origin-master</a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga41ea6f" class="outline-2">
<h2 id="orga41ea6f"><span class="section-number-2">3</span> Guardar cambios de forma temporal (Stash)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2065c8f" class="outline-3">
<h3 id="org2065c8f"><span class="section-number-3">3.1</span> Procedimiento</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Si hicimos cambios en archivos de nuestro ordenador (se dice que es local, y se guarda en <b>unstage</b>),
para guardar esos cambios en otro lugar de "forma temporal" (se guarda en <b>stash</b>) antes de hacer un <b>pull</b> 
</p>

<ol class="org-ol">
<li>Antes de hacer <b>(commit)</b> de los cambios, separamos el codigo con <b>(stash)</b>
Los cambios que se hicimos en los archivos del entorno local estan en <b>unstage</b> sino hicimos commit,
seleccionamos ese bloque de codigo y presionamos <code>zz RET</code> (no le asignamos nombre porque es opcional).
<b>Nota:</b> 
Cuando volvamos al archivo, no apareceran lo cambios, quedaron separados en <b>stash</b></li>
<li>Creamos un <b>branch</b> para las nuevas características que nos pidieron de improviso
Al crear el <b>branch</b> nos aseguramos de separar las nuevas caracteristicas
del <b>commit</b> que hariamos con las funcionalidades que estabamos desarrollando.</li>
<li>Volvemos a traer el codigo que reservamos con <b>(stash)</b>
Seleccionamos los cambios que teniamos <b>stashes</b> y presionamos <code>a</code> (hace referencia a add/agregar)
y volverá a aparecer esos cambios en el archivo, por tanto estará en <b>unstage</b> 
donde quedan las modificaciones que aun no se hizo <b>commit</b> (si lo hicieramos quedarian en <b>stage</b>)</li>
</ol>
</div>
</div>
<div id="outline-container-org42a3f62" class="outline-3">
<h3 id="org42a3f62"><span class="section-number-3">3.2</span> Referencias Web Extraoficiales</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Referencia #1 - Code Tutsplus [Ver Pagina](<a href="https://code.tutsplus.com/es/tutorials/quick-tip-leveraging-the-power-of-git-stash--cms-22988">https://code.tutsplus.com/es/tutorials/quick-tip-leveraging-the-power-of-git-stash--cms-22988</a>)</li>
<li>Referencia #2 - RunRoom -  [Ver Pagina](<a href="https://www.runroom.com/realworld/git-stash">https://www.runroom.com/realworld/git-stash</a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb377333" class="outline-2">
<h2 id="orgb377333"><span class="section-number-2">4</span> Listar historial de commits de un archivo</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org26bc9b9" class="outline-3">
<h3 id="org26bc9b9"><span class="section-number-3">4.1</span> Procedimiento</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Corremos el comando <b>(blame)</b> presionando <code>SPC g b</code> y nos muestra un log de los cambios
Si presionamos <code>b</code> va a los commits anteriores y con <code>q</code> los mas recientes
</p>
</div>
</div>
<div id="outline-container-org506b41a" class="outline-3">
<h3 id="org506b41a"><span class="section-number-3">4.2</span> Referencias Web Oficiales</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Referencia #1 - Magit.vc - [Ver Pagina](<a href="https://magit.vc/manual/magit/Blaming.html">https://magit.vc/manual/magit/Blaming.html</a>)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org90127e1" class="outline-2">
<h2 id="org90127e1"><span class="section-number-2">5</span> Atajos</h2>
<div class="outline-text-2" id="text-5">
<table id="orgdf90cd5" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SPC-g s</td>
<td class="org-left">Muestra el estado de cambios</td>
</tr>

<tr>
<td class="org-left">Tab</td>
<td class="org-left">Expande/Oculta el contenido del bloque donde esta el cursor</td>
</tr>

<tr>
<td class="org-left">s</td>
<td class="org-left">Agrega archivos nuevos/Guarda los cambios locales <b>unstage</b> en <b>stage</b></td>
</tr>

<tr>
<td class="org-left">u</td>
<td class="org-left">Pasa los cambios de <b>stage</b> al entorno local (unstage)</td>
</tr>

<tr>
<td class="org-left">x</td>
<td class="org-left">Descarta los cambios</td>
</tr>

<tr>
<td class="org-left">c c</td>
<td class="org-left">Crear <b>commit</b> (luego de escribir el motivo, se debe finalizar)</td>
</tr>

<tr>
<td class="org-left">, ,</td>
<td class="org-left">Finalizar <b>commit</b></td>
</tr>

<tr>
<td class="org-left">b c</td>
<td class="org-left">Crear un nuevo branch, y hacer checkout de ese branch</td>
</tr>

<tr>
<td class="org-left">b b</td>
<td class="org-left">Cambiar de <b>branch</b> (Ej. Ir del master al develop o testing)</td>
</tr>

<tr>
<td class="org-left">t t</td>
<td class="org-left">Crear un <b>tag</b></td>
</tr>

<tr>
<td class="org-left">p p</td>
<td class="org-left">Hacer <b>push</b></td>
</tr>

<tr>
<td class="org-left">p e</td>
<td class="org-left">Hacer <b>push</b> en un repositorio externo</td>
</tr>

<tr>
<td class="org-left">F p</td>
<td class="org-left">Hacer <b>pull</b></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5cec80e" class="outline-2">
<h2 id="org5cec80e"><span class="section-number-2">6</span> Posibles Situaciones</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgfc3879b" class="outline-3">
<h3 id="orgfc3879b"><span class="section-number-3">6.1</span> Hacer cambios, subirlos y actualizar</h3>
<div class="outline-text-3" id="text-6-1">
<ol class="org-ol">
<li>Guardamos los cambios de forma local <b>(unstage)</b>
Modificamos los archivos, guardamos con con <code>SPC f s</code> ó <code>M-x s</code></li>
<li>Guardo los cambios en <b>Stage</b>
Presionamos <code>SPC g s</code> seleccionamos los cambios que queremos guardar en <b>stage</b> 
con <code>shift</code> ó <code>v</code> y las flechas Down/Up, y presionamos <code>s</code></li>
<li>Hacemos <b>(commit)</b> (aplicamos los cambios)
Presionamos <code>SPC g s</code> seguido de <code>c c</code></li>
<li>Creamos un <b>(branch)</b> del <b>(commit)</b>
Presionamos <code>SPC g s</code> seguido de <code>b c</code> luego <code>RET</code> y escribimos
el nombre del nuevo <b>(branch)</b> donde se guardaran los cambios del <b>(commit)</b></li>
<li>Hacemos <b>(push)</b>
Presionamos <code>SPC g s</code> seguido de <code>p p</code></li>
<li>Hacemos <b>(pull)</b> del <b>(branch)</b> nuevo al <b>master branch</b>
Presionamos <code>SPC g s</code> seguido de <code>b b</code> elegimos el <b>master branch</b>
y terminamos con <code>F p</code></li>
</ol>

<p>
<b>Observación:</b>
Si ya estamos en el menú de <b>magit</b> no es necesario presionar el atajo <code>SPC g s</code> del mode evil de spacemacs
</p>
</div>
</div>
<div id="outline-container-org9b6f5ba" class="outline-3">
<h3 id="org9b6f5ba"><span class="section-number-3">6.2</span> Resolver conflicto, diferencia entre archivos</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Si en el paso 5 del ejemplo anterior hubiesemos tenido un conflicto,
porque alguien modifico el mismo archivo en las mismas lineas.
</p>

<ol class="org-ol">
<li>Hacemos <b>(pull)</b>
Para traer el archivo con el que tenemos conflicto,
ver las diferencias entre este archivo y el archivo local para resolverlo.</li>

<li><p>
Mostramos el conflicto
Presionamos <code>SPC g s</code> y luego <code>e</code> , apareciendo tres buffers 
identificados en la parte inferior izquierda con las letras A, B, C.
</p>

<p>
<b>Nota:</b>
A y B son los archivos en conflicto, y C el archivo final,
el que tendra los conflictos resuelto.
</p></li>

<li>Comparamos las diferencias con <code>n</code> y <code>p</code>
Si presionamos <code>p</code> o <code>n</code> se resaltará los cambios, 
donde <code>p</code> hace de <b>previous diff</b> y <code>n</code> de <b>next diff</b></li>

<li><p>
Corregimos el conflicto
Podemos elegir entre elegir que archivo (buffer A o B) sera el correcto como solucion e ira al buffer C, 
presionando la letra minuscula del buffer que identifica al archivo.
</p>

<p>
<b>Nota:</b>
La otra manera, seria si corregimos las diferencias de forma manual escribiendo en el buffer C
</p></li>

<li>Guardamos los cambios y salimos
Presionamos <code>q</code> seguido de <code>y</code> dos veces para confirmar los cambios realizados.</li>

<li>Verificamos que se hizo el <b>(merge)</b>
Presionamos <code>SPC g s</code> y debe decir "Merging origin/nombre del branch"</li>

<li>Hacemos <b>(commit)</b> del <b>(merge)</b> y <b>(push)</b>
Comiteamos con <code>c c</code> y <code>, ,</code> y por último pusheamos con <code>P p</code></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org0ea77df" class="outline-2">
<h2 id="org0ea77df"><span class="section-number-2">7</span> Referencias</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org18e8544" class="outline-3">
<h3 id="org18e8544"><span class="section-number-3">7.1</span> Paginas recomendadas</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Referencia #1 - Salty Crane - [Ver Pagina](<a href="https://www.saltycrane.com/blog/2018/11/magit-spacemacs-evil-magit-notes/">https://www.saltycrane.com/blog/2018/11/magit-spacemacs-evil-magit-notes/</a>)</li>
</ul>
</div>
</div>
<div id="outline-container-org247f5ff" class="outline-3">
<h3 id="org247f5ff"><span class="section-number-3">7.2</span> Videos de recomendados</h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Referencia #1 - [Ver Video](<a href="https://www.youtube.com/watch?v=7ywEgcbaiys">https://www.youtube.com/watch?v=7ywEgcbaiys</a>)</li>
<li>Referencia #2 - [Ver Video](<a href="https://www.youtube.com/watch?v=qXgGtyjXPiw">https://www.youtube.com/watch?v=qXgGtyjXPiw</a>)</li>
<li>Referencia #3 - [Ver Video](<a href="https://www.youtube.com/watch?v=fFuf3hExF5w">https://www.youtube.com/watch?v=fFuf3hExF5w</a>)</li>
<li>Referencia #4 - [Ver Video](<a href="https://www.youtube.com/watch?v=NDP91RNgT4A">https://www.youtube.com/watch?v=NDP91RNgT4A</a>)</li>
<li>Referencia #5 - [Ver Video](<a href="https://www.youtube.com/watch?v=1IYsiHXR620">https://www.youtube.com/watch?v=1IYsiHXR620</a>)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-04-04 dom 17:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
